# SetDLOptions

## Description
Gets the Double Line Preferences options.  0 for Create Lines, 1 for Create Polygons, 2 for Create Lines and Polygons.

```pascal
PROCEDURE SetDLOptions(options : INTEGER);
```

```python
def vs.SetDLOptions(options):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|options|INTEGER|The options.  0 for Create Lines, 1 for Create Polygons, 2 for Create Lines and Polygons.|

## Remarks
CJG 6-27-06

## Examples
```pascal
SetDLOptions(1);
```
```python
import vs

# Gets the Double Line Preferences options.
options = 1

vs.SetDLOptions(options)
```

## See Also
VS Functions:
GetDLOptions

## Version
Availability: from VectorWorks12.5

## Category
* Document Settings